venkatesan-krishnamoorthy/mcupsdk-core/examples/kernel/dpl/dpl_demo/am263px-lp/r5fss0-0_freertos_mpu/example.syscfg
section14.$name                                    = "Privileged Data Segments";
section14.load_memory                              = "PRIVILEGED_DATA";
section14.group_start                              = "__privileged_data_start__";
section14.group_end                                = "__privileged_data_end__";
section14.output_section.create(2);
section14.output_section[0].$name                  = ".privileged_data";
section14.output_section[0].palignment             = true;
section14.output_section[0].input_section.create(1);
section14.output_section[0].input_section[0].$name = "*(privileged_data)";
section14.output_section[1].palignment             = true;
section14.output_section[1].$name                  = ".data.dpl_demo.freertos_mpu.privileged";
section14.output_section[1].input_section.create(1);
section14.output_section[1].input_section[0].$name = "dpl_demo_freertos_mpu.o*(.data, .bss)";

section15.$name                                    = "User1 Text Sections ";
section15.load_memory                              = "USER1_TEXT";
section15.group_start                              = "__TEXT_USER1_START";
section15.group_end                                = "__TEXT_USER1_END";
section15.output_section.create(1);
section15.output_section[0].macro_name             = "TEXTTASK_SWITCH_MPUPING_SECTION";
section15.output_section[0].palignment             = true;
section15.output_section[0].$name                  = ".text.dpl_demo.freertos_mpu.user1";
section15.output_section[0].input_section.create(1);
section15.output_section[0].input_section[0].$name = "dpl_demo_freertos_mpu_user1.o*(.text)";

section16.$name                                    = "User1 Data Sections ";
section16.group_start                              = "__DATA_USER1_START";
section16.group_end                                = "__DATA_USER1_END";
section16.load_memory                              = "USER1_DATA";
section16.output_section.create(1);
section16.output_section[0].palignment             = true;
section16.output_section[0].$name                  = ".data.dpl_demo.freertos_mpu.user1";
section16.output_section[0].input_section.create(1);
section16.output_section[0].input_section[0].$name = "dpl_demo_freertos_mpu_user1.o*(.data, .bss)";

section17.$name                                    = "User2 Text Sections";
section17.group_start                              = "__TEXT_USER2_START";
section17.group_end                                = "__TEXT_USER2_END";
section17.load_memory                              = "USER2_TEXT";
section17.output_section.create(1);
section17.output_section[0].macro_name             = "TEXTTASK_SWITCH_MPUPING_SECTION";
section17.output_section[0].palignment             = true;
section17.output_section[0].$name                  = ".text.dpl_demo.freertos_mpu.user2";
section17.output_section[0].input_section.create(1);
section17.output_section[0].input_section[0].$name = "dpl_demo_freertos_mpu_user2.o*(.text)";

section18.$name                                    = "User2 Data Sections";
section18.group_start                              = "__DATA_USER2_START";
section18.group_end                                = "__DATA_USER2_END";
section18.load_memory                              = "USER2_DATA";
section18.output_section.create(1);
section18.output_section[0].palignment             = true;
section18.output_section[0].$name                  = ".data.dpl_demo.freertos_mpu.user2";
section18.output_section[0].input_section.create(1);
section18.output_section[0].input_section[0].$name = "dpl_demo_freertos_mpu_user2.o*(.data, .bss)";
